<?php

use App\Models\Country;
use Illuminate\Database\Seeder;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $countries = [
            [
                "id" => 0,
                "title" => "Абхазия"
            ],
            [
                "id" => 1,
                "title" => "Австралия"
            ],
            [
                "id" => 2,
                "title" => "Австрия"
            ],
            [
                "id" => 3,
                "title" => "Азербайджан"
            ],
            [
                "id" => 4,
                "title" => "Албания"
            ],
            [
                "id" => 5,
                "title" => "Алжир"
            ],
            [
                "id" => 6,
                "title" => "Ангола"
            ],
            [
                "id" => 7,
                "title" => "Андорра"
            ],
            [
                "id" => 8,
                "title" => "Антигуа и Барбуда"
            ],
            [
                "id" => 9,
                "title" => "Аргентина"
            ],
            [
                "id" => 10,
                "title" => "Армения"
            ],
            [
                "id" => 11,
                "title" => "Аруба"
            ],
            [
                "id" => 12,
                "title" => "Афганистан"
            ],
            [
                "id" => 13,
                "title" => "Багамские Острова"
            ],
            [
                "id" => 14,
                "title" => "Бангладеш"
            ],
            [
                "id" => 15,
                "title" => "Барбадос"
            ],
            [
                "id" => 16,
                "title" => "Бахрейн"
            ],
            [
                "id" => 17,
                "title" => "Беларусь"
            ],
            [
                "id" => 18,
                "title" => "Белиз"
            ],
            [
                "id" => 19,
                "title" => "Бельгия"
            ],
            [
                "id" => 20,
                "title" => "Бенин"
            ],
            [
                "id" => 21,
                "title" => "Бермудские Острова"
            ],
            [
                "id" => 22,
                "title" => "Болгария"
            ],
            [
                "id" => 23,
                "title" => "Боливия"
            ],
            [
                "id" => 24,
                "title" => "Босния и Герцеговина"
            ],
            [
                "id" => 25,
                "title" => "Ботсвана"
            ],
            [
                "id" => 26,
                "title" => "Бразилия"
            ],
            [
                "id" => 27,
                "title" => "Бруней"
            ],
            [
                "id" => 28,
                "title" => "Буркина-Фасо"
            ],
            [
                "id" => 29,
                "title" => "Бурунди"
            ],
            [
                "id" => 30,
                "title" => "Бутан"
            ],
            [
                "id" => 31,
                "title" => "Вануату"
            ],
            [
                "id" => 32,
                "title" => "Великобритания"
            ],
            [
                "id" => 33,
                "title" => "Венгрия"
            ],
            [
                "id" => 34,
                "title" => "Венесуэла"
            ],
            [
                "id" => 35,
                "title" => "Восточное Самоа"
            ],
            [
                "id" => 36,
                "title" => "Вьетнам"
            ],
            [
                "id" => 37,
                "title" => "Габон"
            ],
            [
                "id" => 38,
                "title" => "Гаити"
            ],
            [
                "id" => 39,
                "title" => "Гайана"
            ],
            [
                "id" => 40,
                "title" => "Гамбия"
            ],
            [
                "id" => 41,
                "title" => "Гана"
            ],
            [
                "id" => 42,
                "title" => "Гватемала"
            ],
            [
                "id" => 43,
                "title" => "Гвиана (фр.)"
            ],
            [
                "id" => 44,
                "title" => "Гвинея"
            ],
            [
                "id" => 45,
                "title" => "Гвинея-Бисау"
            ],
            [
                "id" => 46,
                "title" => "Германия"
            ],
            [
                "id" => 47,
                "title" => "Гондурас"
            ],
            [
                "id" => 48,
                "title" => "Гонконг (Китай)"
            ],
            [
                "id" => 49,
                "title" => "Гренада"
            ],
            [
                "id" => 50,
                "title" => "Гренландия"
            ],
            [
                "id" => 51,
                "title" => "Греция"
            ],
            [
                "id" => 52,
                "title" => "Грузия"
            ],
            [
                "id" => 53,
                "title" => "Гуам"
            ],
            [
                "id" => 54,
                "title" => "Дания"
            ],
            [
                "id" => 55,
                "title" => "Демократическая Республика Конго"
            ],
            [
                "id" => 56,
                "title" => "Джибути"
            ],
            [
                "id" => 57,
                "title" => "Доминика"
            ],
            [
                "id" => 58,
                "title" => "Доминиканская Республика"
            ],
            [
                "id" => 59,
                "title" => "Египет"
            ],
            [
                "id" => 60,
                "title" => "Замбия"
            ],
            [
                "id" => 61,
                "title" => "Западная Сахара"
            ],
            [
                "id" => 62,
                "title" => "Зимбабве"
            ],
            [
                "id" => 63,
                "title" => "Израиль"
            ],
            [
                "id" => 64,
                "title" => "Индия"
            ],
            [
                "id" => 65,
                "title" => "Индонезия"
            ],
            [
                "id" => 66,
                "title" => "Иордания"
            ],
            [
                "id" => 67,
                "title" => "Ирак"
            ],
            [
                "id" => 68,
                "title" => "Ирландия"
            ],
            [
                "id" => 69,
                "title" => "Исландия"
            ],
            [
                "id" => 70,
                "title" => "Испания"
            ],
            [
                "id" => 71,
                "title" => "Италия"
            ],
            [
                "id" => 72,
                "title" => "Йемен"
            ],
            [
                "id" => 73,
                "title" => "Кабо-Верде"
            ],
            [
                "id" => 74,
                "title" => "Казахстан"
            ],
            [
                "id" => 75,
                "title" => "Камбоджа"
            ],
            [
                "id" => 76,
                "title" => "Камерун"
            ],
            [
                "id" => 77,
                "title" => "Канада"
            ],
            [
                "id" => 78,
                "title" => "Катар"
            ],
            [
                "id" => 79,
                "title" => "Кения"
            ],
            [
                "id" => 80,
                "title" => "Кипр"
            ],
            [
                "id" => 81,
                "title" => "Киргизия"
            ],
            [
                "id" => 82,
                "title" => "Кирибати"
            ],
            [
                "id" => 83,
                "title" => "Китай"
            ],
            [
                "id" => 84,
                "title" => "КНДР"
            ],
            [
                "id" => 85,
                "title" => "Колумбия"
            ],
            [
                "id" => 86,
                "title" => "Коморские Острова"
            ],
            [
                "id" => 87,
                "title" => "Конго"
            ],
            [
                "id" => 88,
                "title" => "Королевство Эсватини"
            ],
            [
                "id" => 89,
                "title" => "Коста-Рика"
            ],
            [
                "id" => 90,
                "title" => "Кот-д'Ивуар"
            ],
            [
                "id" => 91,
                "title" => "Куба"
            ],
            [
                "id" => 92,
                "title" => "Кувейт"
            ],
            [
                "id" => 93,
                "title" => "Кюрасао"
            ],
            [
                "id" => 94,
                "title" => "Лаос"
            ],
            [
                "id" => 95,
                "title" => "Латвия"
            ],
            [
                "id" => 96,
                "title" => "Лесото"
            ],
            [
                "id" => 97,
                "title" => "Либерия"
            ],
            [
                "id" => 98,
                "title" => "Ливан"
            ],
            [
                "id" => 99,
                "title" => "Ливия"
            ],
            [
                "id" => 100,
                "title" => "Литва"
            ],
            [
                "id" => 101,
                "title" => "Лихтенштейн"
            ],
            [
                "id" => 102,
                "title" => "Люксембург"
            ],
            [
                "id" => 103,
                "title" => "Маврикий"
            ],
            [
                "id" => 104,
                "title" => "Мавритания"
            ],
            [
                "id" => 105,
                "title" => "Мадагаскар"
            ],
            [
                "id" => 106,
                "title" => "Макао (Китай)"
            ],
            [
                "id" => 107,
                "title" => "Македония"
            ],
            [
                "id" => 108,
                "title" => "Малави"
            ],
            [
                "id" => 109,
                "title" => "Малайзия"
            ],
            [
                "id" => 110,
                "title" => "Мали"
            ],
            [
                "id" => 111,
                "title" => "Мальдивы"
            ],
            [
                "id" => 112,
                "title" => "Мальта"
            ],
            [
                "id" => 113,
                "title" => "Марокко"
            ],
            [
                "id" => 114,
                "title" => "Маршалловы Острова"
            ],
            [
                "id" => 115,
                "title" => "Мексика"
            ],
            [
                "id" => 116,
                "title" => "Мозамбик"
            ],
            [
                "id" => 117,
                "title" => "Молдавия"
            ],
            [
                "id" => 118,
                "title" => "Монголия"
            ],
            [
                "id" => 119,
                "title" => "Мьянма"
            ],
            [
                "id" => 120,
                "title" => "Намибия"
            ],
            [
                "id" => 121,
                "title" => "Непал"
            ],
            [
                "id" => 122,
                "title" => "Нигер"
            ],
            [
                "id" => 123,
                "title" => "Нигерия"
            ],
            [
                "id" => 124,
                "title" => "Нидерланды"
            ],
            [
                "id" => 125,
                "title" => "Никарагуа"
            ],
            [
                "id" => 126,
                "title" => "Новая Зеландия"
            ],
            [
                "id" => 127,
                "title" => "Новая Каледония"
            ],
            [
                "id" => 128,
                "title" => "Норвегия"
            ],
            [
                "id" => 129,
                "title" => "ОАЭ"
            ],
            [
                "id" => 130,
                "title" => "Оман"
            ],
            [
                "id" => 131,
                "title" => "Пакистан"
            ],
            [
                "id" => 132,
                "title" => "Палестина"
            ],
            [
                "id" => 133,
                "title" => "Панама"
            ],
            [
                "id" => 134,
                "title" => "Папуа – Новая Гвинея"
            ],
            [
                "id" => 135,
                "title" => "Парагвай"
            ],
            [
                "id" => 136,
                "title" => "Перу"
            ],
            [
                "id" => 137,
                "title" => "Польша"
            ],
            [
                "id" => 138,
                "title" => "Португалия"
            ],
            [
                "id" => 139,
                "title" => "Пуэрто-Рико (США)"
            ],
            [
                "id" => 140,
                "title" => "Республика Корея"
            ],
            [
                "id" => 141,
                "title" => "Руанда"
            ],
            [
                "id" => 142,
                "title" => "Румыния"
            ],
            [
                "id" => 143,
                "title" => "Сальвадор"
            ],
            [
                "id" => 144,
                "title" => "Самоа"
            ],
            [
                "id" => 145,
                "title" => "Сан-Томе и Принсипи"
            ],
            [
                "id" => 146,
                "title" => "Саудовская Аравия"
            ],
            [
                "id" => 147,
                "title" => "Сейшельские Острова"
            ],
            [
                "id" => 148,
                "title" => "Сенегал"
            ],
            [
                "id" => 149,
                "title" => "Сент-Винсент и Гренадины"
            ],
            [
                "id" => 150,
                "title" => "Сент-Китс и Невис"
            ],
            [
                "id" => 151,
                "title" => "Сент-Люсия"
            ],
            [
                "id" => 152,
                "title" => "Сербия"
            ],
            [
                "id" => 153,
                "title" => "Сингапур"
            ],
            [
                "id" => 154,
                "title" => "Сирия"
            ],
            [
                "id" => 155,
                "title" => "Словакия"
            ],
            [
                "id" => 156,
                "title" => "Словения"
            ],
            [
                "id" => 157,
                "title" => "Соломоновы Острова"
            ],
            [
                "id" => 158,
                "title" => "Сомали"
            ],
            [
                "id" => 159,
                "title" => "Судан"
            ],
            [
                "id" => 160,
                "title" => "Суринам"
            ],
            [
                "id" => 161,
                "title" => "США"
            ],
            [
                "id" => 162,
                "title" => "Сьерра-Леоне"
            ],
            [
                "id" => 163,
                "title" => "Таджикистан"
            ],
            [
                "id" => 164,
                "title" => "Таиланд"
            ],
            [
                "id" => 165,
                "title" => "Тайвань (Китай)"
            ],
            [
                "id" => 166,
                "title" => "Танзания"
            ],
            [
                "id" => 167,
                "title" => "Тимор-Лесте"
            ],
            [
                "id" => 168,
                "title" => "Того"
            ],
            [
                "id" => 169,
                "title" => "Тонга"
            ],
            [
                "id" => 170,
                "title" => "Тринидад и Тобаго"
            ],
            [
                "id" => 171,
                "title" => "Тунис"
            ],
            [
                "id" => 172,
                "title" => "Туркмения"
            ],
            [
                "id" => 173,
                "title" => "Турция"
            ],
            [
                "id" => 174,
                "title" => "Уганда"
            ],
            [
                "id" => 175,
                "title" => "Узбекистан"
            ],
            [
                "id" => 176,
                "title" => "Украина"
            ],
            [
                "id" => 177,
                "title" => "Уругвай"
            ],
            [
                "id" => 178,
                "title" => "Фарерские острова"
            ],
            [
                "id" => 179,
                "title" => "Федеративные Штаты Микронезии (ФШМ)"
            ],
            [
                "id" => 180,
                "title" => "Фиджи"
            ],
            [
                "id" => 181,
                "title" => "Филиппины"
            ],
            [
                "id" => 182,
                "title" => "Финляндия"
            ],
            [
                "id" => 183,
                "title" => "Франция"
            ],
            [
                "id" => 184,
                "title" => "Французская Полинезия"
            ],
            [
                "id" => 185,
                "title" => "Хорватия"
            ],
            [
                "id" => 186,
                "title" => "ЦАР (Центральноафриканская Республика)"
            ],
            [
                "id" => 187,
                "title" => "Чад"
            ],
            [
                "id" => 188,
                "title" => "Черногория"
            ],
            [
                "id" => 189,
                "title" => "Чехия"
            ],
            [
                "id" => 190,
                "title" => "Чили"
            ],
            [
                "id" => 191,
                "title" => "Швейцария"
            ],
            [
                "id" => 192,
                "title" => "Швеция"
            ],
            [
                "id" => 193,
                "title" => "Шри-Ланка"
            ],
            [
                "id" => 194,
                "title" => "Эквадор"
            ],
            [
                "id" => 195,
                "title" => "Экваториальная Гвинея"
            ],
            [
                "id" => 196,
                "title" => "Эритрея"
            ],
            [
                "id" => 197,
                "title" => "Эстония"
            ],
            [
                "id" => 198,
                "title" => "Эфиопия"
            ],
            [
                "id" => 199,
                "title" => "ЮАР"
            ],
            [
                "id" => 200,
                "title" => "Южная Осетия"
            ],
            [
                "id" => 201,
                "title" => "Южный Судан"
            ],
            [
                "id" => 202,
                "title" => "Ямайка"
            ],
            [
                "id" => 203,
                "title" => "Япония"
            ],
        ];

        foreach ($countries as $country) {
            Country::create([
                'id' => $country['id'],
                'title' => $country['title']
            ]);
        }
    }
}
